system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3.15;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           20.0;

libs
(
    "libincompressibleTurbulenceModel.so"
    "libincompressibleRASModels.so"
);

functions
(
    forces
    {
        type                forces;
        functionObjectLibs  ("libforces.so");
        patches             (blades);
        CofR                (0 0 0);
        rhoName             rhoInf;
        rhoInf              1.225;
        outputControl       timeStep;
        outputInterval      100;
    }
);


// ************************************************************************* //
