0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    blades
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    farfield
    {
        type            freestream;
        freestreamValue uniform (10 0 0);
        value           uniform (10 0 0);
    }
    ext_interface
    {
        type            cyclicAMI;
        value           uniform (10 0 0);
    }
    int_interface
    {
        type            cyclicAMI;
        value           uniform (10 0 0);
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
