0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 7.5e-05;

boundaryField
{
    blades
    {
        type            fixedValue;
        value           uniform 0;
    }
    farfield
    {
        type            freestream;
        freestreamValue uniform 7.5e-05;
        value           uniform 7.5e-05;
    }
    ext_interface
    {
        type            cyclicAMI;
        value           uniform 7.5e-05;
    }
    int_interface
    {
        type            cyclicAMI;
        value           uniform 7.5e-05;
    }
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
